In [1]:
import pandas as pd

In [2]:
data = {'Name': ['Alpha','Bravo','Charlie'],'ID':[111,222,333]}

In [3]:
df = pd.DataFrame(data)
df

      Name   ID
0    Alpha  111
1    Bravo  222
2  Charlie  333

Find Alpha's ID

In [4]:
df['Name']=='Alpha'

0     True
1    False
2    False
Name: Name, dtype: bool

In [5]:
df[df['Name']=='Alpha']

    Name   ID
0  Alpha  111

In [6]:
df[df['Name']=='Alpha']['ID'][0]

111

There are now two Alphas. Find both of them.

In [7]:
data = {'Name': ['Alpha','Bravo','Charlie','Alpha'],'ID':[111,222,333,444]}

In [8]:
df = pd.DataFrame(data)
df

      Name   ID
0    Alpha  111
1    Bravo  222
2  Charlie  333
3    Alpha  444

In [9]:
df[df['Name']=='Alpha']

    Name   ID
0  Alpha  111
3  Alpha  444

In [10]:
df[df['Name']=='Alpha']['ID'].tolist()

[111, 444]